; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v10 ?v11)
             (pred_3 ?v2 ?v3)
             (pred_9 ?v10 ?v3)
             (pred_2 ?v13 ?v10 )
	     (pred_10 ?v10)
             (pred_12 ?v5)
             (pred_7 ?v2)
             (pred_11 ?v3)
             (pred_8 ?v10)
             (pred_6 ?v2)
             (pred_5 ?v10)
             (pred_1 ))



(:action op_5
:parameters (?v12 ?v4 ?v1 ?v7)
:precondition (and (pred_12 ?v12) (pred_12 ?v4) (pred_7 ?v1) (pred_11 ?v7)
          (pred_4 ?v12 ?v4) (pred_3 ?v1 ?v7)
                   (pred_9 ?v4 ?v7) (pred_10 ?v12) 
                   (pred_8 ?v4) (pred_6 ?v1))
:effect (and  (pred_5 ?v4) (not (pred_8 ?v4))))


(:action op_2
:parameters (?v12 ?v9)
:precondition (and (pred_12 ?v12) (pred_12 ?v9)
               (pred_10 ?v12) (pred_4 ?v12 ?v9) (pred_5 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v12))))

(:action op_3
:parameters (?v12 ?v1)
:precondition (and (pred_12 ?v12) (pred_7 ?v1) 
                  (pred_10 ?v12) (pred_2 ?v1 ?v12) (pred_1 ))
:effect (and (pred_6 ?v1)
   (not (pred_2 ?v1 ?v12)) (not (pred_1 ))))


(:action op_4
:parameters (?v12 ?v6 ?v8)
:precondition (and (pred_12 ?v12) (pred_7 ?v6) (pred_7 ?v8)
                  (pred_10 ?v12) (pred_6 ?v8) (pred_2 ?v6 ?v12))
:effect (and (pred_6 ?v6) (pred_2 ?v8 ?v12)
        (not (pred_6 ?v8)) (not (pred_2 ?v6 ?v12))))

(:action op_1
:parameters (?v12 ?v1)
:precondition (and (pred_12 ?v12) (pred_7 ?v1) 
                  (pred_10 ?v12) (pred_6 ?v1))
:effect (and (pred_1 ) (pred_2 ?v1 ?v12) (not (pred_6 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_01 obj_17 obj_09 obj_15 obj_16 obj_13 obj_12 obj_18 obj_02 obj_03 obj_10 obj_08 obj_22 obj_21 obj_19
    obj_14 obj_11 obj_20
    obj_05 obj_07 obj_04
    )

    (:init
       (pred_1)

       (pred_12 obj_06)
       (pred_12 obj_01)
       (pred_12 obj_17)
       (pred_12 obj_09)
       (pred_12 obj_15)
       (pred_12 obj_16)
       (pred_12 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_18)
       (pred_12 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_10)
       (pred_12 obj_08)
       (pred_12 obj_22)
       (pred_12 obj_21)
       (pred_12 obj_19)
       (pred_11 obj_14)
       (pred_11 obj_11)
       (pred_11 obj_20)
       (pred_7 obj_05)
       (pred_7 obj_07)
       (pred_7 obj_04)

       (pred_4 obj_06 obj_15)
       (pred_4 obj_06 obj_01)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_01 obj_17)
       (pred_4 obj_01 obj_06)
       (pred_4 obj_17 obj_13)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_17 obj_01)
       (pred_4 obj_09 obj_12)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_15 obj_18)
       (pred_4 obj_15 obj_16)
       (pred_4 obj_15 obj_06)
       (pred_4 obj_16 obj_02)
       (pred_4 obj_16 obj_13)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_16 obj_15)
       (pred_4 obj_13 obj_03)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_13 obj_17)
       (pred_4 obj_13 obj_16)
       (pred_4 obj_12 obj_10)
       (pred_4 obj_12 obj_09)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_18 obj_08)
       (pred_4 obj_18 obj_02)
       (pred_4 obj_18 obj_15)
       (pred_4 obj_02 obj_22)
       (pred_4 obj_02 obj_03)
       (pred_4 obj_02 obj_16)
       (pred_4 obj_02 obj_18)
       (pred_4 obj_03 obj_21)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_03 obj_13)
       (pred_4 obj_03 obj_02)
       (pred_4 obj_10 obj_19)
       (pred_4 obj_10 obj_12)
       (pred_4 obj_10 obj_03)
       (pred_4 obj_08 obj_22)
       (pred_4 obj_08 obj_18)
       (pred_4 obj_22 obj_21)
       (pred_4 obj_22 obj_02)
       (pred_4 obj_22 obj_08)
       (pred_4 obj_21 obj_19)
       (pred_4 obj_21 obj_03)
       (pred_4 obj_21 obj_22)
       (pred_4 obj_19 obj_10)
       (pred_4 obj_19 obj_21)
       (pred_8 obj_18)
       (pred_8 obj_02)
       (pred_8 obj_19)
       (pred_9  obj_18 obj_14)
       (pred_9  obj_02 obj_11)
       (pred_9  obj_19 obj_20)
       (pred_5 obj_06)
       (pred_5 obj_01)
       (pred_5 obj_17)
       (pred_5 obj_09)
       (pred_5 obj_15)
       (pred_5 obj_16)
       (pred_5 obj_13)
       (pred_5 obj_12)
       (pred_5 obj_03)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_22)
       (pred_5 obj_21)

       (pred_3  obj_05 obj_14)
       (pred_3  obj_07 obj_11)
       (pred_3  obj_04 obj_20)
       (pred_2 obj_05 obj_12)
       (pred_2 obj_07 obj_06)
       (pred_2 obj_04 obj_06)
       (pred_10 obj_09)
    )

    (:goal (and
       (pred_2 obj_05 obj_21)
       (pred_2 obj_07 obj_13)
    ))
(:constraints
  (always (not (pred_10 obj_17)))
)
)

; plan
1. (op_2 obj_09 obj_12)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_12)
   goals met: 0 of 2
2. (op_2 obj_12 obj_13)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_13)
   goals met: 0 of 2
3. (op_2 obj_13 obj_16)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_16)
   goals met: 0 of 2
4. (op_2 obj_16 obj_15)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_15)
   goals met: 0 of 2
5. (op_2 obj_15 obj_06)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_06)
   goals met: 0 of 2
6. (op_3 obj_06 obj_07)
   deleted: (pred_2 obj_07 obj_06) (pred_1)
   added: (pred_6 obj_07)
   goals met: 0 of 2
7. (op_2 obj_06 obj_15)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_15)
   goals met: 0 of 2
8. (op_2 obj_15 obj_16)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_16)
   goals met: 0 of 2
9. (op_2 obj_16 obj_13)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_13)
   goals met: 0 of 2
10. (op_1 obj_13 obj_07)
   deleted: (pred_6 obj_07)
   added: (pred_1) (pred_2 obj_07 obj_13)
   goals met: 1 of 2
11. (op_2 obj_13 obj_12)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_12)
   goals met: 1 of 2
12. (op_3 obj_12 obj_05)
   deleted: (pred_2 obj_05 obj_12) (pred_1)
   added: (pred_6 obj_05)
   goals met: 1 of 2
13. (op_2 obj_12 obj_13)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_13)
   goals met: 1 of 2
14. (op_2 obj_13 obj_03)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_03)
   goals met: 1 of 2
15. (op_2 obj_03 obj_21)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_21)
   goals met: 1 of 2
16. (op_1 obj_21 obj_05)
   deleted: (pred_6 obj_05)
   added: (pred_1) (pred_2 obj_05 obj_21)
   goals met: 2 of 2
